Core/src/Catalogs/ЛицензионныеКарточкиТранспортныхСредств/ЛицензионныеКарточкиТранспортныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЛицензионныеКарточкиТранспортныхСредств</name>
  <owners>Catalog.ТранспортныеСредства</owners>
  <attributes>
    <name>СерияЛицензионнойКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛицензионнойКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЛицензионнойКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиЛицензионнойКарты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияТранспортнойЛицензии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецЛицензии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерВГосударственномОргане</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Catalogs/ЛицензионныеКарточкиТранспортныхСредств/Forms/ФормаЭлемента/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	
	Объект.Наименование = Нстр("ru='Серия ';ka='Серия '") + Объект.СерияЛицензионнойКарты + Нстр("ru=' № ';ka=' № '") + Объект.НомерЛицензионнойКарты + Нстр("ru=' от ';ka='ვისგან'") + Формат(Объект.ДатаВыдачиЛицензионнойКарты, "ДФ=dd.MM.yyyy");
	
	Если ЗначениеЗаполнено(Объект.ВладелецЛицензии) Тогда
		
		Объект.Наименование = Объект.Наименование + Нстр("ru='. Владелец: ';ka='. Владелец: '") + Объект.ВладелецЛицензии;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СерияЛицензионнойКартыПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерЛицензионнойКартыПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыдачиЛицензионнойКартыПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецЛицензииПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

#КонецОбласти
